SSierraAl/STM32_AI_Camera-ROI-Windowing/x-cube-n6-camera-capture-main/Src/app.c
 /**
 ******************************************************************************
 * @file    app.c
 * @author  GPM Application Team
 *
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include "app.h"

#include <assert.h>
#include <stdint.h>
#include <stdio.h>

#include "app_cam.h"
#include "app_config.h"
#include "app_jpg.h"
#include "cmw_camera.h"
#include "stm32n6xx_hal.h"
#include "ulist.h"
#ifdef STM32N6570_DK_REV
#include "stm32n6570_discovery.h"
#else
#include "stm32n6xx_nucleo.h"
#endif
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"
#include "utils.h"
#include "uvcl.h"
/* ROI test support - no additional includes needed */

/* Disable jpeg support for nucleo due to lack of memory */
#ifdef STM32N6570_NUCLEO_REV
#define DISABLE_JPEG 1
#endif

#ifndef APP_VERSION_STRING
#define APP_VERSION_STRING "dev"
#endif

#define CAPT_BUFFER_NB                2
#define JPEG_BUFFER_NB                CAPT_BUFFER_NB

#define FREERTOS_PRIORITY(p) ((UBaseType_t)((int)tskIDLE_PRIORITY + configMAX_PRIORITIES / 2 + (p)))

struct list_protected {
  struct ulist head;
  SemaphoreHandle_t lock;
  StaticSemaphore_t lock_buffer;
  SemaphoreHandle_t sem;
  StaticSemaphore_t sem_buffer;
  int level_dbg;
};

struct buffer {
  struct ulist list;
  uint8_t *buffer;
  int size;
  int len;
  int is_jpeg;
};

struct streaming_ctx {
  int counter;
  int is_streaming;
  UVCL_StreamConf_t stream;
};

struct streaming_req {
  struct streaming_ctx ctx;
  SemaphoreHandle_t lock;
  StaticSemaphore_t lock_buffer;
};

/* threads */
 /* uvc thread */
static StaticTask_t uvc_thread;
static StackType_t uvc_thread_stack[2 * configMINIMAL_STACK_SIZE];
  /* isp thread */
static StaticTask_t isp_thread;
static StackType_t isp_thread_stack[2 * configMINIMAL_STACK_SIZE];
static SemaphoreHandle_t isp_sem;
static StaticSemaphore_t isp_sem_buffer;
/* capture thread */
static StaticTask_t capture_thread;
static StackType_t capture_thread_stack[configMINIMAL_STACK_SIZE];
static SemaphoreHandle_t capture_sem;
static StaticSemaphore_t capture_sem_buffer;

/* capture buffers */
static uint8_t capture_buffer[CAPT_BUFFER_NB][MAX_IMG_FRAME_SIZE] ALIGN_32 IN_PSRAM;
static struct buffer capture[CAPT_BUFFER_NB];
#ifndef DISABLE_JPEG
/* jpg */
static uint8_t jpeg_buffer[JPEG_BUFFER_NB][MAX_IMG_FRAME_SIZE] ALIGN_32 IN_PSRAM;
static struct buffer jpeg[JPEG_BUFFER_NB];
#endif

/* uvc */
static struct uvcl_callbacks uvcl_cbs;

/* list heads */
struct list_protected capt_free_buffers;
struct list_protected capt_capturing_buffers;
struct list_protected capt_ready_buffers;
struct list_protected uvc_in_use_buffers;
struct list_protected jpeg_free_buffers;

static struct streaming_req streaming_req;

static int sr_init(struct streaming_req *sr)
{
  sr->ctx.counter = 0;
  sr->ctx.is_streaming = 0;
  sr->lock = xSemaphoreCreateMutexStatic(&sr->lock_buffer);
  assert(sr->lock);

  return 0;
}

static void sr_lock(struct streaming_req *sr)
{
  int ret;

  ret = xSemaphoreTake(sr->lock, portMAX_DELAY);
  assert(ret == pdTRUE);
}

static void sr_unlock(struct streaming_req *sr)
{
  int ret;

  ret = xSemaphoreGive(sr->lock);
  assert(ret == pdTRUE);
}

static void sr_set_streaming_active(struct streaming_req *sr, UVCL_StreamConf_t *stream)
{
  sr_lock(sr);
  sr->ctx.counter++;
  sr->ctx.is_streaming = 1;
  sr->ctx.stream = *stream;
  sr_unlock(sr);
}

static void sr_set_streaming_inactive(struct streaming_req *sr)
{
  sr_lock(sr);
  sr->ctx.counter++;
  sr->ctx.is_streaming = 0;
  sr_unlock(sr);
}

static int sr_is_streaming(struct streaming_req *sr, struct streaming_ctx *ctx)
{
  int res;

  sr_lock(sr);
  res = sr->ctx.is_streaming;
  if (res)
    *ctx = sr->ctx;
  sr_unlock(sr);

  return res;
}

static int sr_is_valid(struct streaming_req *sr, struct streaming_ctx *ctx)
{
  return sr->ctx.counter == ctx->counter;
}

static int lp_init(struct list_protected *lp)
{
  ulist_init_head(&lp->head);
  lp->lock = xSemaphoreCreateMutexStatic(&lp->lock_buffer);
  assert(lp->lock);
  lp->sem = xSemaphoreCreateCountingStatic(CAPT_BUFFER_NB, 0, &lp->sem_buffer);
  assert(lp->sem);
  lp->level_dbg = 0;

  return 0;
}

static void lp_lock(struct list_protected *lp)
{
  int ret;

  ret = xSemaphoreTake(lp->lock, portMAX_DELAY);
  assert(ret == pdTRUE);
}

static void lp_unlock(struct list_protected *lp)
{
  int ret;

  ret = xSemaphoreGive(lp->lock);
  assert(ret == pdTRUE);
}

static int lp_push(struct list_protected *lp, struct buffer *buffer)
{
  int ret;

  assert(!xPortIsInsideInterrupt());

  lp_lock(lp);
  ulist_add_tail(&buffer->list, &lp->head);
  lp->level_dbg++;
  lp_unlock(lp);

  ret = xSemaphoreGive(lp->sem);
  assert(ret == pdTRUE);

  return 0;
}

static struct buffer *lp_pop(struct list_protected *lp, int is_blocking)
{
  struct buffer *res;
  int ret;

  assert(!xPortIsInsideInterrupt());

  ret = xSemaphoreTake(lp->sem, is_blocking ? portMAX_DELAY : 0);
  if (ret == pdFALSE)
    return NULL;

  lp_lock(lp);
  res = ulist_entry(lp->head.next, struct buffer, list);
  lp->level_dbg--;
  assert(res);
  ulist_del(&res->list);
  lp_unlock(lp);

  return res;
}

static struct buffer *lp_remove_buffer(struct list_protected *lp, uint8_t *buffer)
{
  struct buffer *res = NULL;
  struct buffer *current;
  struct buffer *tmp;
  int ret;

  assert(!xPortIsInsideInterrupt());

  ret = xSemaphoreTake(lp->sem, 0);
  assert(ret == pdTRUE);

  lp_lock(lp);
  ulist_for_each_entry_safe(current, tmp, &lp->head, list) {
    if (current->buffer != buffer)
      continue;
    res = current;
    assert(res);
    ulist_del(&res->list);
    break;
  }
  lp->level_dbg--;
  lp_unlock(lp);

  return res;
}

