SSierraAl/STM32_AI_Camera-ROI-Windowing/x-cube-n6-camera-capture-main/Src/app.c
static int uvcl_payload_to_dcmipp_type(int payload_type)
{
  switch (payload_type) {
  case UVCL_PAYLOAD_UNCOMPRESSED_YUY2:
    return DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1;
    break;
  case UVCL_PAYLOAD_FB_JPEG:
  case UVCL_PAYLOAD_JPEG:
    return DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1;
    break;
  case UVCL_PAYLOAD_FB_RGB565:
    return DCMIPP_PIXEL_PACKER_FORMAT_RGB565_1;
    break;
  case UVCL_PAYLOAD_FB_BGR3:
    return DCMIPP_PIXEL_PACKER_FORMAT_RGB888_YUV444_1;
    break;
  case UVCL_PAYLOAD_FB_GREY:
    return DCMIPP_PIXEL_PACKER_FORMAT_MONO_Y8_G8_1;
    break;
  case UVCL_PAYLOAD_FB_GREY_D3DFMT_L8:
    return DCMIPP_PIXEL_PACKER_FORMAT_MONO_Y8_G8_1;
    break;
  default:
    assert(0);
  }

  return DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1;
}

static int uvcl_payload_to_bpp(int payload_type)
{
  switch (payload_type) {
  case UVCL_PAYLOAD_UNCOMPRESSED_YUY2:
    return 2;
    break;
  case UVCL_PAYLOAD_FB_JPEG:
  case UVCL_PAYLOAD_JPEG:
    return 1;
    break;
  case UVCL_PAYLOAD_FB_RGB565:
    return 2;
    break;
  case UVCL_PAYLOAD_FB_BGR3:
    return 3;
    break;
  case UVCL_PAYLOAD_FB_GREY:
    return 1;
    break;
  case UVCL_PAYLOAD_FB_GREY_D3DFMT_L8:
    return 1;
    break;
  default:
    assert(0);
  }

  return DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1;
}

static const char *uvcl_payload_to_name(int payload_type)
{
  switch (payload_type) {
  case UVCL_PAYLOAD_UNCOMPRESSED_YUY2:
    return "YUV2";
    break;
  case UVCL_PAYLOAD_FB_JPEG:
    return "JPEG_FB";
    break;
  case UVCL_PAYLOAD_JPEG:
    return "JPEG";
    break;
  case UVCL_PAYLOAD_FB_RGB565:
    return "RGB565";
    break;
  case UVCL_PAYLOAD_FB_BGR3:
    return "BGR3";
    break;
  case UVCL_PAYLOAD_FB_GREY:
    return "GREY";
    break;
  case UVCL_PAYLOAD_FB_GREY_D3DFMT_L8:
    return "GREY_L8";
    break;
  default:
    assert(0);
  }

  return "UNKNOWN";
}

/* ROI Register Test Functions - Direct I2C access to IMX335 sensor */

#include "cmw_io.h"
#include "imx335.h"
#include "imx335_reg.h"

/* Static variable to track I2C initialization */
static int i2c_initialized = 0;
static int camera_powered = 0;

/* Dynamic ROI Management System */
/* Supports multiple ROI configurations with different output sizes */

#define MAX_ROI_CONFIGS 8

typedef struct {
  uint16_t x_start;      /* ROI start X on sensor */
  uint16_t y_start;      /* ROI start Y on sensor */
  uint16_t width;        /* Output width (can be scaled) */
  uint16_t height;       /* Output height (can be scaled) */
  uint16_t sensor_width; /* Actual sensor readout width */
  uint16_t sensor_height;/* Actual sensor readout height */
  uint8_t  active;       /* Is this ROI configuration active */
} ROI_Config_t;

/* ROI configuration storage */
static ROI_Config_t roi_configs[MAX_ROI_CONFIGS];
static int roi_config_count = 0;
static int current_roi_index = -1;

/* Forward declarations for functions used before definition */
static int App_IMX335_WriteReg(uint16_t reg, uint8_t *data, uint16_t len);
static int App_IMX335_ReadReg(uint16_t reg, uint8_t *data, uint16_t len);

/* Get current ROI configuration */
ROI_Config_t* App_GetCurrentROI(void)
{
  if (current_roi_index >= 0 && current_roi_index < roi_config_count) {
    return &roi_configs[current_roi_index];
  }
  return NULL;
}

/* Add a new ROI configuration */
int App_AddROIConfig(uint16_t x_start, uint16_t y_start, 
                     uint16_t out_width, uint16_t out_height)
{
  if (roi_config_count >= MAX_ROI_CONFIGS) {
    printf("[ROI] ERROR: Maximum ROI configs reached (%d)\r\n", MAX_ROI_CONFIGS);
    return -1;
  }
  
  ROI_Config_t *cfg = &roi_configs[roi_config_count];
  cfg->x_start = x_start;
  cfg->y_start = y_start;
  cfg->width = out_width;
  cfg->height = out_height;
  /* Sensor readout size matches output for now */
  cfg->sensor_width = out_width;
  cfg->sensor_height = out_height;
  cfg->active = 0;
  
  roi_config_count++;
  printf("[ROI] Added config #%d: ROI(%u,%u) -> Output %dx%d\r\n",
         roi_config_count-1, x_start, y_start, out_width, out_height);
  return roi_config_count - 1;
}

/* Activate a ROI configuration by index */
int App_ActivateROI(int index)
{
  if (index < 0 || index >= roi_config_count) {
    printf("[ROI] ERROR: Invalid ROI index %d\r\n", index);
    return -1;
  }
  
  current_roi_index = index;
  ROI_Config_t *cfg = &roi_configs[index];
  cfg->active = 1;
  
  printf("[ROI] Activated ROI #%d: x=%u, y=%u, out=%dx%d\r\n",
         index, cfg->x_start, cfg->y_start, cfg->width, cfg->height);
  return 0;
}

/* Deactivate current ROI (use full sensor) */
void App_DeactivateROI(void)
{
  if (current_roi_index >= 0 && current_roi_index < roi_config_count) {
    roi_configs[current_roi_index].active = 0;
  }
  current_roi_index = -1;
  printf("[ROI] ROI deactivated (full sensor)\r\n");
}

/* Apply ROI to sensor registers */
static int App_ApplyROIToSensor(ROI_Config_t *cfg)
{
  uint8_t data[4];
  uint16_t x_end, y_end;
  uint32_t vmax, shutter;
  uint8_t hold, mode;
  int retry_count;
  int max_retries = 3;
  
  if (cfg == NULL) {
    return -1;
  }
  
  printf("[ROI] Applying to sensor: x=%u, y=%u, w=%u, h=%u\r\n", 
         cfg->x_start, cfg->y_start, cfg->sensor_width, cfg->sensor_height);
  
  x_end = cfg->x_start + cfg->sensor_width - 1;
  y_end = cfg->y_start + cfg->sensor_height - 1;
  
  /* Calculate VMAX for sensor height + blanking (100 lines for stability) */
  vmax = cfg->sensor_height + 100;
  shutter = vmax - 100;
  if (shutter < 9) shutter = 9;
  
  /* Put sensor in STANDBY mode with retry */
  mode = 0x01;
  for (retry_count = 0; retry_count < max_retries; retry_count++) {
    if (App_IMX335_WriteReg(0x3000, &mode, 1) == 0) break;
    HAL_Delay(5);
  }
  HAL_Delay(10);
  
  /* Set HOLD with retry */
  hold = 1;
  for (retry_count = 0; retry_count < max_retries; retry_count++) {
    if (App_IMX335_WriteReg(0x3001, &hold, 1) == 0) break;
    HAL_Delay(5);
  }
  
  /* Write AREA3 registers (ROI window on sensor) with retry */
  data[0] = cfg->x_start & 0xFF;
  data[1] = (cfg->x_start >> 8) & 0xFF;
  for (retry_count = 0; retry_count < max_retries; retry_count++) {
    if (App_IMX335_WriteReg(0x3074, data, 2) == 0) break;
    HAL_Delay(5);
  }
  
