SSierraAl/STM32_AI_Camera-ROI-Windowing/x-cube-n6-camera-capture-main/Src/app.c
  data[0] = cfg->y_start & 0xFF;
  data[1] = (cfg->y_start >> 8) & 0xFF;
  for (retry_count = 0; retry_count < max_retries; retry_count++) {
    if (App_IMX335_WriteReg(0x3076, data, 2) == 0) break;
    HAL_Delay(5);
  }
  
  data[0] = x_end & 0xFF;
  data[1] = (x_end >> 8) & 0xFF;
  for (retry_count = 0; retry_count < max_retries; retry_count++) {
    if (App_IMX335_WriteReg(0x3078, data, 2) == 0) break;
    HAL_Delay(5);
  }
  
  data[0] = y_end & 0xFF;
  data[1] = (y_end >> 8) & 0xFF;
  for (retry_count = 0; retry_count < max_retries; retry_count++) {
    if (App_IMX335_WriteReg(0x307A, data, 2) == 0) break;
    HAL_Delay(5);
  }
  
  /* Write VMAX with retry */
  data[0] = vmax & 0xFF;
  data[1] = (vmax >> 8) & 0xFF;
  data[2] = (vmax >> 16) & 0xFF;
  data[3] = (vmax >> 24) & 0xFF;
  for (retry_count = 0; retry_count < max_retries; retry_count++) {
    if (App_IMX335_WriteReg(0x3030, data, 4) == 0) break;
    HAL_Delay(5);
  }
  
  /* Write SHUTTER with retry */
  data[0] = shutter & 0xFF;
  data[1] = (shutter >> 8) & 0xFF;
  data[2] = (shutter >> 16) & 0xFF;
  for (retry_count = 0; retry_count < max_retries; retry_count++) {
    if (App_IMX335_WriteReg(0x3058, data, 3) == 0) break;
    HAL_Delay(5);
  }
  
  /* Clear HOLD to apply with retry */
  hold = 0;
  for (retry_count = 0; retry_count < max_retries; retry_count++) {
    if (App_IMX335_WriteReg(0x3001, &hold, 1) == 0) break;
    HAL_Delay(5);
  }
  HAL_Delay(20);
  
  printf("[ROI] Sensor registers updated\r\n");
  return 0;
}

/* 
 * Dynamic ROI capture function
 * This function:
 * 1. Applies ROI to sensor
 * 2. Reconfigures camera pipeline for new resolution
 * 3. Returns the output dimensions to use
 */
int App_CaptureWithROI(uint16_t x_start, uint16_t y_start, 
                       uint16_t width, uint16_t height,
                       uint16_t *out_width, uint16_t *out_height)
{
  /* Add this as a new ROI config if not exists */
  int idx = App_AddROIConfig(x_start, y_start, width, height);
  if (idx < 0) return -1;
  
  /* Activate it */
  if (App_ActivateROI(idx) < 0) return -1;
  
  ROI_Config_t *cfg = &roi_configs[idx];
  
  /* Apply to sensor */
  if (App_ApplyROIToSensor(cfg) < 0) return -1;
  
  /* Return output dimensions */
  *out_width = cfg->width;
  *out_height = cfg->height;
  
  return 0;
}

/* List all configured ROIs */
void App_ListROIs(void)
{
  printf("\r\n=== Configured ROIs ===\r\n");
  for (int i = 0; i < roi_config_count; i++) {
    ROI_Config_t *cfg = &roi_configs[i];
    printf("ROI #%d: [%s] x=%u, y=%u, out=%dx%d, sensor=%dx%d\r\n",
           i, cfg->active ? "ACTIVE" : "----",
           cfg->x_start, cfg->y_start,
           cfg->width, cfg->height,
           cfg->sensor_width, cfg->sensor_height);
  }
  printf("=========================\r\n");
}

/* 
 * Change ROI position dynamically while keeping the same output size
 * This updates AREA3 position registers AND VMAX timing for proper frame sync
 */
int App_ChangeROI(int index)
{
  if (index < 0 || index >= roi_config_count) {
    printf("[ROI] ERROR: Invalid ROI index %d\r\n", index);
    return -1;
  }
  
  ROI_Config_t *cfg = &roi_configs[index];
  uint8_t data[4];
  uint8_t hold;
  uint32_t vmax;
  int retry_count;
  int max_retries = 3;
  
  printf("[ROI] Switching to ROI #%d: x=%u, y=%u, size=%dx%d\r\n", 
         index, cfg->x_start, cfg->y_start, cfg->sensor_width, cfg->sensor_height);
  
  /* Calculate VMAX for this ROI height + blanking (100 lines for safety) */
  /* IMX335 needs sufficient vertical blanking for stable operation */
  vmax = cfg->sensor_height + 100;
  
  /* CRITICAL: Wait for current frame to complete before changing registers */
  /* This prevents register write conflicts during active frame readout */
  HAL_Delay(30);  /* Wait at least one frame period */
  
  /* Put sensor in STANDBY mode first */
  uint8_t mode = 0x01;
  for (retry_count = 0; retry_count < max_retries; retry_count++) {
    if (App_IMX335_WriteReg(0x3000, &mode, 1) == 0) break;
    HAL_Delay(5);
  }
  HAL_Delay(10);  /* Wait for sensor to enter standby */
  
  /* Set HOLD bit to latch all register changes at once */
  hold = 1;
  for (retry_count = 0; retry_count < max_retries; retry_count++) {
    if (App_IMX335_WriteReg(0x3001, &hold, 1) == 0) break;
    HAL_Delay(5);
  }
  
  /* Update AREA3 position registers */
  data[0] = cfg->x_start & 0xFF;
  data[1] = (cfg->x_start >> 8) & 0xFF;
  for (retry_count = 0; retry_count < max_retries; retry_count++) {
    if (App_IMX335_WriteReg(0x3074, data, 2) == 0) break;
    HAL_Delay(5);
  }  /* X start */
  
  data[0] = cfg->y_start & 0xFF;
  data[1] = (cfg->y_start >> 8) & 0xFF;
  for (retry_count = 0; retry_count < max_retries; retry_count++) {
    if (App_IMX335_WriteReg(0x3076, data, 2) == 0) break;
    HAL_Delay(5);
  }  /* Y start */
  
  /* Calculate and update end positions */
  uint16_t x_end = cfg->x_start + cfg->sensor_width - 1;
  uint16_t y_end = cfg->y_start + cfg->sensor_height - 1;
  
  data[0] = x_end & 0xFF;
  data[1] = (x_end >> 8) & 0xFF;
  for (retry_count = 0; retry_count < max_retries; retry_count++) {
    if (App_IMX335_WriteReg(0x3078, data, 2) == 0) break;
    HAL_Delay(5);
  }  /* X end */
  
  data[0] = y_end & 0xFF;
  data[1] = (y_end >> 8) & 0xFF;
  for (retry_count = 0; retry_count < max_retries; retry_count++) {
    if (App_IMX335_WriteReg(0x307A, data, 2) == 0) break;
    HAL_Delay(5);
  }  /* Y end */
  
  /* CRITICAL: Update VMAX timing register for proper frame sync */
  data[0] = vmax & 0xFF;
  data[1] = (vmax >> 8) & 0xFF;
  data[2] = (vmax >> 16) & 0xFF;
  data[3] = (vmax >> 24) & 0xFF;
  for (retry_count = 0; retry_count < max_retries; retry_count++) {
    if (App_IMX335_WriteReg(0x3030, data, 4) == 0) break;
    HAL_Delay(5);
  }  /* VMAX */
  
  /* Clear HOLD to apply all changes simultaneously */
  hold = 0;
  for (retry_count = 0; retry_count < max_retries; retry_count++) {
    if (App_IMX335_WriteReg(0x3001, &hold, 1) == 0) break;
    HAL_Delay(5);
  }
  HAL_Delay(20);  /* Wait for settings to stabilize after HOLD clear */
  
  /* Return to streaming mode */
  mode = 0x00;
  for (retry_count = 0; retry_count < max_retries; retry_count++) {
    if (App_IMX335_WriteReg(0x3000, &mode, 1) == 0) break;
    HAL_Delay(5);
  }
  
  /* Give sensor time to stabilize before next operation */
  HAL_Delay(50);
  
  /* Update active status */
  if (current_roi_index >= 0 && current_roi_index < roi_config_count) {
    roi_configs[current_roi_index].active = 0;
  }
  current_roi_index = index;
  cfg->active = 1;
  
