SSierraAl/STM32_AI_Camera-ROI-Windowing/x-cube-n6-camera-capture-main/Src/app.c
  printf("[ROI] ROI #%d activated (VMAX=%lu)\r\n", index, vmax);
  return 0;
}

/* Global flag for ROI switcher task */
static uint8_t roi_switcher_enabled = 0;
static int roi_switcher_interval_ms = 2000;  /* Default 2 seconds */
static TaskHandle_t roi_switcher_task_handle = NULL;
static StaticTask_t roi_switcher_task_buffer;
static StackType_t roi_switcher_task_stack[256];

/* ROI Switcher Task - switches ROI position periodically */
static void roi_switcher_task(void *argument)
{
  int current_roi = 0;
  
  printf("[ROI] Switcher task started (interval: %d ms)\r\n", roi_switcher_interval_ms);
  
  while (roi_switcher_enabled) {
    /* Switch to next ROI */
    current_roi++;
    if (current_roi >= roi_config_count) {
      current_roi = 0;
    }
    
    App_ChangeROI(current_roi);
    
    /* Wait for interval */
    vTaskDelay(pdMS_TO_TICKS(roi_switcher_interval_ms));
  }
  
  printf("[ROI] Switcher task stopped\r\n");
  vTaskDelete(NULL);
}

/* Start the ROI switcher task */
void App_StartROISwitcher(int interval_ms)
{
  if (roi_switcher_enabled) {
    printf("[ROI] Switcher already running\r\n");
    return;
  }
  
  roi_switcher_interval_ms = interval_ms;
  roi_switcher_enabled = 1;
  
  /* Use static task creation like other tasks in the project */
  roi_switcher_task_handle = xTaskCreateStatic(
    roi_switcher_task,           /* Task function */
    "roi_switcher",              /* Task name */
    256,                         /* Stack size */
    NULL,                        /* Task parameter */
    2,                           /* Task priority */
    roi_switcher_task_stack,     /* Task stack */
    &roi_switcher_task_buffer    /* Task control block */
  );
  
  printf("[ROI] Switcher started: switches every %d ms\r\n", interval_ms);
}

/* Stop the ROI switcher task */
void App_StopROISwitcher(void)
{
  roi_switcher_enabled = 0;
  if (roi_switcher_task_handle != NULL) {
    vTaskDelete(roi_switcher_task_handle);
    roi_switcher_task_handle = NULL;
  }
  printf("[ROI] Switcher stopped\r\n");
}

/**
  * @brief  Power on the camera sensor
  * @retval 0 on success, -1 on failure
  */
static int App_Camera_PowerOn(void)
{
  GPIO_InitTypeDef gpio_init_structure = {0};
  
  if (camera_powered) {
    return 0;
  }
  
  printf("[DEBUG] Powering on camera sensor...\r\n");
  
  /* Enable camera power GPIOs */
  EN_CAM_GPIO_ENABLE_VDDIO();
  EN_CAM_GPIO_CLK_ENABLE();
  NRST_CAM_GPIO_ENABLE_VDDIO();
  NRST_CAM_GPIO_CLK_ENABLE();
  
  /* Configure EN_CAM pin (Enable) */
  gpio_init_structure.Pin       = EN_CAM_PIN;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(EN_CAM_PORT, &gpio_init_structure);
  
  /* Configure NRST_CAM pin (Reset) */
  gpio_init_structure.Pin       = NRST_CAM_PIN;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(NRST_CAM_PORT, &gpio_init_structure);
  
  /* Enable camera power */
  HAL_GPIO_WritePin(EN_CAM_PORT, EN_CAM_PIN, GPIO_PIN_SET);
  
  /* Reset sequence: hold reset low, then release */
  HAL_GPIO_WritePin(NRST_CAM_PORT, NRST_CAM_PIN, GPIO_PIN_RESET);
  HAL_Delay(5);  /* Minimum 2ms required */
  HAL_GPIO_WritePin(NRST_CAM_PORT, NRST_CAM_PIN, GPIO_PIN_SET);
  HAL_Delay(10); /* Wait for sensor to stabilize */
  
  camera_powered = 1;
  printf("[DEBUG] Camera powered on successfully\r\n");
  
  return 0;
}

/**
  * @brief  Initialize I2C2 for sensor access
  * @retval 0 on success, -1 on failure
  */
static int App_I2C_Init(void)
{
  int32_t ret;
  
  if (i2c_initialized) {
    return 0;
  }
  
  /* Power on camera first */
  App_Camera_PowerOn();
  
  ret = BSP_I2C2_Init();
  if (ret == BSP_ERROR_NONE) {
    i2c_initialized = 1;
    printf("I2C2 initialized successfully\r\n");
  } else {
    printf("I2C2 initialization failed: %d\r\n", ret);
  }
  
  return (ret == BSP_ERROR_NONE) ? 0 : -1;
}

/**
  * @brief  Check if IMX335 sensor is present on I2C bus
  * @retval 1 if sensor detected, 0 if not
  */
static int App_IMX335_Detect(void)
{
  uint8_t data;
  
  if (App_I2C_Init() != 0) {
    printf("[DEBUG] I2C init failed\r\n");
    return 0;
  }
  
  /* Try to read the sensor ID register */
  if (BSP_I2C2_ReadReg16(0x34, 0x3912, &data, 1) == BSP_ERROR_NONE) {
    printf("[DEBUG] Sensor detected at 0x34, ID register read successful\r\n");
    return 1;
  }
  
  printf("[DEBUG] Sensor NOT detected at 0x34\r\n");
  return 0;
}

/**
  * @brief  Read IMX335 sensor register via BSP I2C functions
  * @param  reg   Register address to read (16-bit)
  * @param  data  Pointer to store read data
  * @param  len   Number of bytes to read
  * @retval 0 on success, -1 on failure
  */
static int App_IMX335_ReadReg(uint16_t reg, uint8_t *data, uint16_t len)
{
  int32_t ret;
  
  /* Ensure I2C is initialized */
  if (App_I2C_Init() != 0) {
    return -1;
  }
  
  /* Use 16-bit register address size for IMX335 sensor */
  /* Sensor I2C address is 0x34 (7-bit) */
  ret = BSP_I2C2_ReadReg16(0x34, reg, data, len);
  
  if (ret != BSP_ERROR_NONE) {
    printf("[DEBUG] ReadReg16(0x34, 0x%04X) failed: %d\r\n", reg, ret);
  }
  
  return (ret == BSP_ERROR_NONE) ? 0 : -1;
}

/**
  * @brief  Write IMX335 sensor register via BSP I2C functions
  * @param  reg   Register address to write (16-bit)
  * @param  data  Pointer to data to write
  * @param  len   Number of bytes to write
  * @retval 0 on success, -1 on failure
  */
static int App_IMX335_WriteReg(uint16_t reg, uint8_t *data, uint16_t len)
{
  int32_t ret;
  
  /* Ensure I2C is initialized */
  if (App_I2C_Init() != 0) {
    return -1;
  }
  
  /* Use 16-bit register address size for IMX335 sensor */
  /* Sensor I2C address is 0x34 (7-bit) */
  ret = BSP_I2C2_WriteReg16(0x34, reg, data, len);
  
  if (ret != BSP_ERROR_NONE) {
    printf("[DEBUG] WriteReg16(0x34, 0x%04X) failed: %d\r\n", reg, ret);
  }
  
