SSierraAl/STM32_AI_Camera-ROI-Windowing/x-cube-n6-camera-capture-main/Src/app.c
  return (ret == BSP_ERROR_NONE) ? 0 : -1;
}

/**
  * @brief  Read and print a single register value
  */
static void App_PrintReg(uint16_t reg, uint8_t *data, uint16_t len, int success)
{
  uint32_t value = 0;
  
  if (success) {
    for (int i = 0; i < len; i++) {
      value |= ((uint32_t)data[i] << (i * 8));
    }
    
    if (len == 1) {
      printf("  0x%04X = 0x%02X (%u)\r\n", reg, data[0], data[0]);
    } else if (len == 2) {
      printf("  0x%04X = 0x%04X (%u)\r\n", reg, value, value);
    } else {
      printf("  0x%04X = 0x%08X (%u)\r\n", reg, value, value);
    }
  } else {
    printf("  0x%04X = READ FAILED\r\n", reg);
  }
}

static void app_main_pipe_vsync_event()
{
  BaseType_t xHigherPriorityTaskWoken = pdFALSE;
  int ret;

  ret = xSemaphoreGiveFromISR(isp_sem, &xHigherPriorityTaskWoken);
  if (ret == pdTRUE)
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
}

/**
  * @brief  Test function to read and print IMX335 sensor registers
  *         Call this after camera initialization to verify ROI register access
  */
void App_TestIMX335Registers(void)
{
  uint8_t data[4];
  int ret;
  
  printf("\r\n========================================\r\n");
  printf("IMX335 Sensor Register Test\r\n");
  printf("========================================\r\n");
  
  /* First, try to detect the sensor */
  printf("\r\nDetecting IMX335 sensor...\r\n");
  if (!App_IMX335_Detect()) {
    printf("WARNING: Sensor not detected! Check I2C connections and power.\r\n");
    printf("Note: The camera middleware may have exclusive I2C access.\r\n");
  }
  
  /* Read sensor ID (0x3912) */
  printf("\r\nSensor ID Register (0x3912): ");
  ret = App_IMX335_ReadReg(0x3912, data, 1);
  App_PrintReg(0x3912, data, 1, ret == 0);
  
  /* Read key configuration registers */
  printf("\r\nKey Configuration Registers:\r\n");
  
  printf("  0x3000 (MODE_SELECT):      ");
  ret = App_IMX335_ReadReg(0x3000, data, 1);
  App_PrintReg(0x3000, data, 1, ret == 0);
  
  printf("  0x3030-0x3033 (VMAX):      ");
  ret = App_IMX335_ReadReg(0x3030, data, 4);
  App_PrintReg(0x3030, data, 4, ret == 0);
  
  printf("  0x3058-0x305A (SHUTTER):   ");
  ret = App_IMX335_ReadReg(0x3058, data, 3);
  App_PrintReg(0x3058, data, 3, ret == 0);
  
  printf("  0x30E8-0x30E9 (GAIN):      ");
  ret = App_IMX335_ReadReg(0x30E8, data, 2);
  App_PrintReg(0x30E8, data, 2, ret == 0);
  
  printf("  0x304E (HREVERSE):         ");
  ret = App_IMX335_ReadReg(0x304E, data, 1);
  App_PrintReg(0x304E, data, 1, ret == 0);
  
  printf("  0x304F (VREVERSE):         ");
  ret = App_IMX335_ReadReg(0x304F, data, 1);
  App_PrintReg(0x304F, data, 1, ret == 0);
  
  printf("  0x329E (TPG):              ");
  ret = App_IMX335_ReadReg(0x329E, data, 1);
  App_PrintReg(0x329E, data, 1, ret == 0);
  
  /* Read ROI-specific registers */
  printf("\r\nROI Window Registers:\r\n");
  
  printf("  0x318C-0x318D (X_START):   ");
  ret = App_IMX335_ReadReg(0x318C, data, 2);
  App_PrintReg(0x318C, data, 2, ret == 0);
  
  printf("  0x318E-0x318F (Y_START):   ");
  ret = App_IMX335_ReadReg(0x318E, data, 2);
  App_PrintReg(0x318E, data, 2, ret == 0);
  
  printf("  0x3190-0x3191 (X_END):     ");
  ret = App_IMX335_ReadReg(0x3190, data, 2);
  App_PrintReg(0x3190, data, 2, ret == 0);
  
  printf("  0x3192-0x3193 (Y_END):     ");
  ret = App_IMX335_ReadReg(0x3192, data, 2);
  App_PrintReg(0x3192, data, 2, ret == 0);
  
  printf("  0x3074-0x3075 (AREA3):     ");
  ret = App_IMX335_ReadReg(0x3074, data, 2);
  App_PrintReg(0x3074, data, 2, ret == 0);
  
  printf("\r\n========================================\r\n");
}

/**
  * @brief  Set a custom ROI window on the IMX335 sensor
  * @param  x_start  Horizontal start pixel (0-2591)
  * @param  y_start  Vertical start line (0-1943)
  * @param  width    Window width (1-2592)
  * @param  height   Window height (1-1944)
  * @note   This function uses direct I2C access to write AREA3 registers
  *         Note: Registers 0x318C-0x3193 are READ-ONLY output registers
  *         The actual ROI is configured via AREA3 registers (0x3074-0x307B)
  */
void App_SetIMX335ROI(uint16_t x_start, uint16_t y_start, uint16_t width, uint16_t height)
{
  uint8_t data[2];
  uint16_t x_end = x_start + width - 1;
  uint16_t y_end = y_start + height - 1;
  uint8_t hold;
  uint8_t mode;
  
  printf("\r\n========================================\r\n");
  printf("Setting IMX335 ROI (Direct I2C Access)\r\n");
  printf("========================================\r\n");
  printf("Requested: x=%u, y=%u, width=%u, height=%u\r\n", x_start, y_start, width, height);
  printf("Calculated: x_end=%u, y_end=%u\r\n", x_end, y_end);
  
  /* First, put sensor in STANDBY mode for register writes */
  printf("\r\nPutting sensor in STANDBY mode...\r\n");
  mode = 0x01;  /* STANDBY */
  App_IMX335_WriteReg(0x3000, &mode, 1);
  HAL_Delay(10);
  
  /* Set HOLD bit to prevent intermediate states */
  hold = 1;
  App_IMX335_WriteReg(0x3001, &hold, 1);  /* HOLD register */
  
  /* Write AREA3 window registers (native IMX335 ROI control) */
  /* AREA3_ST_ADR_1 (0x3074-0x3075) - X start address */
  data[0] = x_start & 0xFF;
  data[1] = (x_start >> 8) & 0xFF;
  printf("Writing AREA3_ST_ADR_1 (0x3074) = %u (0x%04X)\r\n", x_start, x_start);
  App_IMX335_WriteReg(0x3074, data, 2);
  
  /* AREA3_ST_ADR_2 (0x3076-0x3077) - Y start address */
  data[0] = y_start & 0xFF;
  data[1] = (y_start >> 8) & 0xFF;
  printf("Writing AREA3_ST_ADR_2 (0x3076) = %u (0x%04X)\r\n", y_start, y_start);
  App_IMX335_WriteReg(0x3076, data, 2);
  
  /* AREA3_END_ADR_1 (0x3078-0x3079) - X end address */
  data[0] = x_end & 0xFF;
  data[1] = (x_end >> 8) & 0xFF;
  printf("Writing AREA3_END_ADR_1 (0x3078) = %u (0x%04X)\r\n", x_end, x_end);
  App_IMX335_WriteReg(0x3078, data, 2);
  
  /* AREA3_END_ADR_2 (0x307A-0x307B) - Y end address */
  data[0] = y_end & 0xFF;
  data[1] = (y_end >> 8) & 0xFF;
  printf("Writing AREA3_END_ADR_2 (0x307A) = %u (0x%04X)\r\n", y_end, y_end);
  App_IMX335_WriteReg(0x307A, data, 2);
  
  /* Clear HOLD bit to apply changes */
  hold = 0;
  App_IMX335_WriteReg(0x3001, &hold, 1);
  
  printf("\r\nROI set via AREA3 registers!\r\n");
  printf("Expected buffer size: %.2f KB\r\n", (width * height * 1.25) / 1024.0);
  printf("\r\nNOTE: Registers 0x318C-0x3193 are READ-ONLY (calculated by sensor)\r\n");
  printf("        The actual ROI is configured via AREA3 registers (0x3074-0x307B)\r\n");
  
