SSierraAl/STM32_AI_Camera-ROI-Windowing/x-cube-n6-camera-capture-main/Src/app.c
  /* Verify by reading back */
  printf("\r\nVerifying AREA3 registers after write:\r\n");
  
  printf("  0x3074-0x3075 (AREA3_X_START):   ");
  App_IMX335_ReadReg(0x3074, data, 2);
  uint32_t val = data[0] | (data[1] << 8);
  printf("  = 0x%04X (%u)\r\n", val, val);
  
  printf("  0x3076-0x3077 (AREA3_Y_START):   ");
  App_IMX335_ReadReg(0x3076, data, 2);
  val = data[0] | (data[1] << 8);
  printf("  = 0x%04X (%u)\r\n", val, val);
  
  printf("  0x3078-0x3079 (AREA3_X_END):     ");
  App_IMX335_ReadReg(0x3078, data, 2);
  val = data[0] | (data[1] << 8);
  printf("  = 0x%04X (%u)\r\n", val, val);
  
  printf("  0x307A-0x307B (AREA3_Y_END):     ");
  App_IMX335_ReadReg(0x307A, data, 2);
  val = data[0] | (data[1] << 8);
  printf("  = 0x%04X (%u)\r\n", val, val);
  
  printf("========================================\r\n");
}

/**
  * @brief  Set ROI using AREA3 registers (IMX335 native ROI control)
  * @param  x_start  Horizontal start pixel (0-2591)
  * @param  y_start  Vertical start line (0-1943)
  * @param  width    Window width (1-2592)
  * @param  height   Window height (1-1944)
  * @note   This uses the native AREA3 registers for ROI control
  */
void App_SetIMX335ROIArea3(uint16_t x_start, uint16_t y_start, uint16_t width, uint16_t height)
{
  uint8_t data[2];
  uint16_t x_end = x_start + width - 1;
  uint16_t y_end = y_start + height - 1;
  uint8_t mode;
  
  printf("\r\n========================================\r\n");
  printf("Setting IMX335 ROI via AREA3 registers\r\n");
  printf("========================================\r\n");
  printf("Requested: x=%u, y=%u, width=%u, height=%u\r\n", x_start, y_start, width, height);
  printf("Calculated: x_end=%u, y_end=%u\r\n", x_end, y_end);
  
  /* Put sensor in STANDBY mode for register writes */
  printf("\r\nPutting sensor in STANDBY mode...\r\n");
  mode = 0x01;  /* STANDBY */
  App_IMX335_WriteReg(0x3000, &mode, 1);
  HAL_Delay(10);
  
  /* Write AREA3 window registers */
  /* AREA3_ST_ADR_1 (0x3074-0x3075) - X start address */
  data[0] = x_start & 0xFF;
  data[1] = (x_start >> 8) & 0xFF;
  printf("Writing AREA3_ST_ADR_1 (0x3074) = %u (0x%04X)\r\n", x_start, x_start);
  App_IMX335_WriteReg(0x3074, data, 2);
  
  /* AREA3_ST_ADR_2 (0x3076-0x3077) - Y start address */
  data[0] = y_start & 0xFF;
  data[1] = (y_start >> 8) & 0xFF;
  printf("Writing AREA3_ST_ADR_2 (0x3076) = %u (0x%04X)\r\n", y_start, y_start);
  App_IMX335_WriteReg(0x3076, data, 2);
  
  /* AREA3_END_ADR_1 (0x3078-0x3079) - X end address */
  data[0] = x_end & 0xFF;
  data[1] = (x_end >> 8) & 0xFF;
  printf("Writing AREA3_END_ADR_1 (0x3078) = %u (0x%04X)\r\n", x_end, x_end);
  App_IMX335_WriteReg(0x3078, data, 2);
  
  /* AREA3_END_ADR_2 (0x307A-0x307B) - Y end address */
  data[0] = y_end & 0xFF;
  data[1] = (y_end >> 8) & 0xFF;
  printf("Writing AREA3_END_ADR_2 (0x307A) = %u (0x%04X)\r\n", y_end, y_end);
  App_IMX335_WriteReg(0x307A, data, 2);
  
  printf("\r\nROI set via AREA3! Expected buffer size: %.2f KB\r\n", (width * height * 1.25) / 1024.0);
  
  /* Verify by reading back */
  printf("\r\nVerifying AREA3 registers after write:\r\n");
  
  printf("  0x3074-0x3075 (AREA3_X_START):   ");
  App_IMX335_ReadReg(0x3074, data, 2);
  uint32_t val = data[0] | (data[1] << 8);
  printf("  = 0x%04X (%u)\r\n", val, val);
  
  printf("  0x3076-0x3077 (AREA3_Y_START):   ");
  App_IMX335_ReadReg(0x3076, data, 2);
  val = data[0] | (data[1] << 8);
  printf("  = 0x%04X (%u)\r\n", val, val);
  
  printf("  0x3078-0x3079 (AREA3_X_END):     ");
  App_IMX335_ReadReg(0x3078, data, 2);
  val = data[0] | (data[1] << 8);
  printf("  = 0x%04X (%u)\r\n", val, val);
  
  printf("  0x307A-0x307B (AREA3_Y_END):     ");
  App_IMX335_ReadReg(0x307A, data, 2);
  val = data[0] | (data[1] << 8);
  printf("  = 0x%04X (%u)\r\n", val, val);
  
  printf("========================================\r\n");
}

static void isp_thread_fct(void *arg)
{
  int ret;

  while (1) {
    ret = xSemaphoreTake(isp_sem, portMAX_DELAY);
    assert(ret == pdTRUE);

    CAM_IspUpdate();
  }
}

static void app_main_pipe_frame_event()
{
  BaseType_t xHigherPriorityTaskWoken = pdFALSE;
  int ret;

  ret = xSemaphoreGiveFromISR(capture_sem, &xHigherPriorityTaskWoken);
  if (ret == pdTRUE)
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
}

static void capture_thread_fct(void *arg)
{
  struct buffer *current_buffer;
  struct buffer *next_buffer;
  int ret;

  while (1) {
    ret = xSemaphoreTake(capture_sem, portMAX_DELAY);
    assert(ret == pdTRUE);

    next_buffer = lp_pop(&capt_free_buffers, 0);
    if (next_buffer) {
      ret = HAL_DCMIPP_PIPE_SetMemoryAddress(CMW_CAMERA_GetDCMIPPHandle(), DCMIPP_PIPE1,
                                             DCMIPP_MEMORY_ADDRESS_0, (uint32_t) next_buffer->buffer);
      assert(ret == HAL_OK);
      current_buffer = lp_pop(&capt_capturing_buffers, 0);
      assert(current_buffer);
      lp_push(&capt_capturing_buffers, next_buffer);
      lp_push(&capt_ready_buffers, current_buffer);
    }
  }
}

static void app_uvc_streaming_active(struct uvcl_callbacks *cbs, UVCL_StreamConf_t stream)
{
  sr_set_streaming_active(&streaming_req, &stream);

  BSP_LED_On(LED_RED);
}

static void app_uvc_streaming_inactive(struct uvcl_callbacks *cbs)
{
  sr_set_streaming_inactive(&streaming_req);

  BSP_LED_Off(LED_RED);
}

static void app_uvc_frame_release(struct uvcl_callbacks *cbs, void *frame)
{
  struct buffer *buffer;

  buffer = lp_remove_buffer(&uvc_in_use_buffers, frame);
  assert(buffer);

  if (buffer->is_jpeg)
    lp_push(&jpeg_free_buffers, buffer);
  else
    lp_push(&capt_free_buffers, buffer);
}

static void UVC_Init()
{
  const UVCL_StreamConf_t streams[] = IMG_STREAMS;
  UVCL_Conf_t uvcl_conf = { 0 };
  int ret;
  int i;

  for (i = 0; i < ARRAY_NB(streams); i++)
    uvcl_conf.streams[i] = streams[i];
  uvcl_conf.streams_nb = ARRAY_NB(streams);
  uvcl_conf.is_immediate_mode = 1;
  uvcl_cbs.streaming_active = app_uvc_streaming_active;
  uvcl_cbs.streaming_inactive = app_uvc_streaming_inactive;
  uvcl_cbs.frame_release = app_uvc_frame_release;
  ret = UVCL_Init(USB1_OTG_HS, &uvcl_conf, &uvcl_cbs);
  assert(ret == 0);
}

static void send_raw_frame(struct buffer *buffer)
{
  int ret;

  ret = lp_push(&uvc_in_use_buffers, buffer);
  assert(ret == 0);
  ret = UVCL_ShowFrame(buffer->buffer, buffer->len);
  if (ret) {
    buffer = lp_remove_buffer(&uvc_in_use_buffers, buffer->buffer);
    assert(buffer);
    lp_push(&capt_free_buffers, buffer);
  }
}

static void send_jpg_frame(struct buffer *buffer)
{
#ifndef DISABLE_JPEG
  struct buffer *jpeg_buffer;
  int ret;

  jpeg_buffer = lp_pop(&jpeg_free_buffers, 0);
  if (!jpeg_buffer) {
    ret = lp_push(&capt_free_buffers, buffer);
    assert(ret == 0);
    return ;
  }

  ret = JPG_Encode(jpeg_buffer->buffer, buffer->buffer, jpeg_buffer->size, buffer->len);
  assert(ret > 0);
  jpeg_buffer->len = ret;

  ret = lp_push(&capt_free_buffers, buffer);
  assert(ret == 0);
  ret = lp_push(&uvc_in_use_buffers, jpeg_buffer);
  assert(ret == 0);

  ret = UVCL_ShowFrame(jpeg_buffer->buffer, jpeg_buffer->len);
  if (ret) {
    jpeg_buffer = lp_remove_buffer(&uvc_in_use_buffers, jpeg_buffer->buffer);
    assert(jpeg_buffer);
    lp_push(&jpeg_free_buffers, jpeg_buffer);
  }
#else
  assert(0);
#endif
}

static void JPEG_Init(UVCL_StreamConf_t *stream)
{
#ifndef DISABLE_JPEG
  JPG_conf_t jpg_conf = { 0 };
  int ret;

  jpg_conf.width = stream->width;
  jpg_conf.height = stream->height;
  jpg_conf.fmt_src = JPG_SRC_YUV422;

