SSierraAl/STM32_AI_Camera-ROI-Windowing/x-cube-n6-camera-capture-main/Src/app.c
  ret = JPG_Init(&jpg_conf);
  assert(ret == 0);
#else
  assert(0);
#endif
}

static void capture_init(UVCL_StreamConf_t *current, int is_jpeg)
{
  CAM_conf_t cam_conf = { 0 };
  struct buffer *buffer;
  int bpp;
  int ret;
  int i;

  if (is_jpeg)
    JPEG_Init(current);

  /* 
   * CRITICAL: Apply ROI BEFORE CAM_Init() so the sensor outputs the correct size
   * from the beginning. The ISP pipeline will be configured for this size.
   */
  ROI_Config_t *active_roi = App_GetCurrentROI();
  if (active_roi != NULL) {
    printf("[ROI] Applying ROI BEFORE CAM_Init: x=%u, y=%u, size=%dx%d\r\n",
           active_roi->x_start, active_roi->y_start,
           active_roi->sensor_width, active_roi->sensor_height);
    
    /* Apply ROI to sensor - this must happen BEFORE CAM_Init */
    if (App_ApplyROIToSensor(active_roi) == 0) {
      printf("[ROI] Sensor configured for ROI output: %dx%d\r\n",
             active_roi->sensor_width, active_roi->sensor_height);
    }
  }

  /* start camera pipeline - ISP will be configured for the ROI size */
  cam_conf.capture_width = current->width;
  cam_conf.capture_height = current->height;
  cam_conf.fps = current->fps;
  cam_conf.dcmipp_output_format = uvcl_payload_to_dcmipp_type(current->payload_type);
  cam_conf.is_rgb_swap = 0;
  CAM_Init(&cam_conf);

  bpp = uvcl_payload_to_bpp(current->payload_type);
  for (i = 0; i < CAPT_BUFFER_NB; i++)
    capture[i].len = current->width * current->height * bpp;
  buffer = lp_pop(&capt_free_buffers, 1);
  assert(buffer);
  ret = lp_push(&capt_capturing_buffers, buffer);
  assert(ret == 0);

  CAM_CapturePipe_Start(buffer->buffer, CMW_MODE_CONTINUOUS);
}

static void capture_deinit(int is_jpeg)
{
  struct buffer *buffer;

  CAM_Deinit();
  if (is_jpeg)
    JPG_Deinit();

  do {
    buffer = lp_pop(&capt_capturing_buffers, 0);
    if (buffer) {
      lp_push(&capt_free_buffers, buffer);
    }
  } while (buffer);

  do {
    buffer = lp_pop(&capt_ready_buffers, 0);
    if (buffer) {
      lp_push(&capt_free_buffers, buffer);
    }
  } while (buffer);
}

static void uvc_thread_fct(void *arg)
{
  struct streaming_ctx current = { 0 };
  struct buffer *buffer;
  int is_jpeg;

  while (1) {
    /* wait for stream request */
    while (!sr_is_streaming(&streaming_req, &current)) {
      HAL_Delay(1);
    }

    /* copy request */
    is_jpeg = current.stream.payload_type == UVCL_PAYLOAD_JPEG || current.stream.payload_type == UVCL_PAYLOAD_FB_JPEG;
    printf("Start streaming %s | %dx%d@%dfps\r\n", uvcl_payload_to_name(current.stream.payload_type), current.stream.width,
           current.stream.height, current.stream.fps);

    capture_init(&current.stream, is_jpeg);
    /* looping until no more streaming */
    while (1) {
      do {
        buffer = lp_pop(&capt_ready_buffers, 0);
        if (!buffer)
          HAL_Delay(1);
      } while (!buffer && sr_is_valid(&streaming_req, &current));

      if (!buffer)
        break;

      if (is_jpeg)
        send_jpg_frame(buffer);
      else
        send_raw_frame(buffer);
    }

    printf("End streaming\r\n");
    capture_deinit(is_jpeg);
  }
}

static void LIST_Init()
{
  int ret;
  int i;

  ret = lp_init(&capt_free_buffers);
  assert(ret == 0);
  ret = lp_init(&capt_capturing_buffers);
  assert(ret == 0);
  ret = lp_init(&capt_ready_buffers);
  assert(ret == 0);
  ret = lp_init(&uvc_in_use_buffers);
  assert(ret == 0);
  ret = lp_init(&jpeg_free_buffers);
  assert(ret == 0);

  for (i = 0; i < CAPT_BUFFER_NB; i++) {
    capture[i].buffer = capture_buffer[i];
    capture[i].size = MAX_IMG_FRAME_SIZE;
    capture[i].is_jpeg = 0;
    ret = lp_push(&capt_free_buffers, &capture[i]);
    assert(ret == 0);
  }

#ifndef DISABLE_JPEG
  for (i = 0; i < JPEG_BUFFER_NB; i++) {
    jpeg[i].buffer = jpeg_buffer[i];
    jpeg[i].size = MAX_IMG_FRAME_SIZE;
    jpeg[i].is_jpeg = 1;
    ret = lp_push(&jpeg_free_buffers, &jpeg[i]);
    assert(ret == 0);
  }
#endif
}

static void app_display_info_header()
{
  printf("========================================\r\n");
  printf("x-cube-n6-camera-capture v2.0.0 (%s)\r\n", APP_VERSION_STRING);
  printf("Build date & time: %s %s\r\n", __DATE__, __TIME__);
#if defined(__GNUC__)
  printf("Compiler: GCC %d.%d.%d\r\n", __GNUC__, __GNUC_MINOR__, __GNUC_PATCHLEVEL__);
#elif defined(__ICCARM__)
  printf("Compiler: IAR EWARM %d.%d.%d\r\n", __VER__ / 1000000, (__VER__ / 1000) % 1000 ,__VER__ % 1000);
#else
  printf("Compiler: Unknown\r\n");
#endif
  printf("HAL: %lu.%lu.%lu\r\n", __STM32N6xx_HAL_VERSION_MAIN, __STM32N6xx_HAL_VERSION_SUB1, __STM32N6xx_HAL_VERSION_SUB2);
  printf("========================================\r\n");
}

void app_run()
{
  UBaseType_t capture_priority = FREERTOS_PRIORITY(3);
  UBaseType_t isp_priority = FREERTOS_PRIORITY(2);
  UBaseType_t uvc_priority = FREERTOS_PRIORITY(0);
  TaskHandle_t hdl;

  app_display_info_header();
  /* Enable DWT so DWT_CYCCNT works when debugger not attached */
  CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;

  LIST_Init();
  sr_init(&streaming_req);

  /* UVC ss */
  UVC_Init();

  /* sems + mutex init */
  isp_sem = xSemaphoreCreateCountingStatic(1, 0, &isp_sem_buffer);
  assert(isp_sem);
  capture_sem = xSemaphoreCreateCountingStatic(1, 0, &capture_sem_buffer);
  assert(capture_sem);

  /* threads init */
  hdl = xTaskCreateStatic(uvc_thread_fct, "uvc", configMINIMAL_STACK_SIZE * 2, NULL, uvc_priority, uvc_thread_stack,
                          &uvc_thread);
  assert(hdl != NULL);
  hdl = xTaskCreateStatic(isp_thread_fct, "isp", configMINIMAL_STACK_SIZE * 2, NULL, isp_priority, isp_thread_stack,
                          &isp_thread);
  assert(hdl != NULL);
  hdl = xTaskCreateStatic(capture_thread_fct, "capture", configMINIMAL_STACK_SIZE, NULL, capture_priority, capture_thread_stack,
                          &capture_thread);
  assert(hdl != NULL);

  BSP_LED_On(LED_GREEN);
}

int CMW_CAMERA_PIPE_FrameEventCallback(uint32_t pipe)
{
  if (pipe == DCMIPP_PIPE1)
    app_main_pipe_frame_event();

  return HAL_OK;
}

int CMW_CAMERA_PIPE_VsyncEventCallback(uint32_t pipe)
{
  if (pipe == DCMIPP_PIPE1)
    app_main_pipe_vsync_event();

  return HAL_OK;
}
